; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	infrared1 - mode
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 180)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 199)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 133)
	(= (data Phenomenon5 spectrograph2) 249)
	(= (data Planet6 spectrograph2) 94)
	(= (data Phenomenon7 spectrograph2) 278)
	(= (data Phenomenon8 spectrograph2) 245)
	(= (data Phenomenon9 spectrograph2) 85)
	(= (data Star10 spectrograph2) 202)
	(= (data Planet11 spectrograph2) 81)
	(= (data Phenomenon5 spectrograph0) 154)
	(= (data Planet6 spectrograph0) 42)
	(= (data Phenomenon7 spectrograph0) 270)
	(= (data Phenomenon8 spectrograph0) 229)
	(= (data Phenomenon9 spectrograph0) 201)
	(= (data Star10 spectrograph0) 284)
	(= (data Planet11 spectrograph0) 215)
	(= (data Phenomenon5 infrared1) 207)
	(= (data Planet6 infrared1) 211)
	(= (data Phenomenon7 infrared1) 11)
	(= (data Phenomenon8 infrared1) 18)
	(= (data Phenomenon9 infrared1) 103)
	(= (data Star10 infrared1) 200)
	(= (data Planet11 infrared1) 142)
	(= (slew_time Star3 GroundStation0) 47.85)
	(= (slew_time GroundStation0 Star3) 47.85)
	(= (slew_time Star3 GroundStation1) 1.947)
	(= (slew_time GroundStation1 Star3) 1.947)
	(= (slew_time Star3 GroundStation2) 29.41)
	(= (slew_time GroundStation2 Star3) 29.41)
	(= (slew_time GroundStation1 GroundStation0) 56.64)
	(= (slew_time GroundStation0 GroundStation1) 56.64)
	(= (slew_time GroundStation2 GroundStation0) 34.21)
	(= (slew_time GroundStation0 GroundStation2) 34.21)
	(= (slew_time GroundStation2 GroundStation1) 23.84)
	(= (slew_time GroundStation1 GroundStation2) 23.84)
	(= (slew_time Star4 GroundStation0) 13.97)
	(= (slew_time GroundStation0 Star4) 13.97)
	(= (slew_time Star4 GroundStation1) 10.53)
	(= (slew_time GroundStation1 Star4) 10.53)
	(= (slew_time Star4 GroundStation2) 41.75)
	(= (slew_time GroundStation2 Star4) 41.75)
	(= (slew_time Star4 Star3) 1.401)
	(= (slew_time Star3 Star4) 1.401)
	(= (slew_time Phenomenon5 GroundStation0) 6.366)
	(= (slew_time GroundStation0 Phenomenon5) 6.366)
	(= (slew_time Phenomenon5 GroundStation1) 8.418)
	(= (slew_time GroundStation1 Phenomenon5) 8.418)
	(= (slew_time Phenomenon5 GroundStation2) 7.817)
	(= (slew_time GroundStation2 Phenomenon5) 7.817)
	(= (slew_time Phenomenon5 Star3) 5.904)
	(= (slew_time Star3 Phenomenon5) 5.904)
	(= (slew_time Phenomenon5 Star4) 1.127)
	(= (slew_time Star4 Phenomenon5) 1.127)
	(= (slew_time Planet6 GroundStation0) 15.48)
	(= (slew_time GroundStation0 Planet6) 15.48)
	(= (slew_time Planet6 GroundStation1) 68.18)
	(= (slew_time GroundStation1 Planet6) 68.18)
	(= (slew_time Planet6 GroundStation2) 35.58)
	(= (slew_time GroundStation2 Planet6) 35.58)
	(= (slew_time Planet6 Star3) 21.97)
	(= (slew_time Star3 Planet6) 21.97)
	(= (slew_time Planet6 Star4) 27.82)
	(= (slew_time Star4 Planet6) 27.82)
	(= (slew_time Planet6 Phenomenon5) 2.637)
	(= (slew_time Phenomenon5 Planet6) 2.637)
	(= (slew_time Phenomenon7 GroundStation0) 25.75)
	(= (slew_time GroundStation0 Phenomenon7) 25.75)
	(= (slew_time Phenomenon7 GroundStation1) 22.27)
	(= (slew_time GroundStation1 Phenomenon7) 22.27)
	(= (slew_time Phenomenon7 GroundStation2) 57.07)
	(= (slew_time GroundStation2 Phenomenon7) 57.07)
	(= (slew_time Phenomenon7 Star3) 34.97)
	(= (slew_time Star3 Phenomenon7) 34.97)
	(= (slew_time Phenomenon7 Star4) 7.062)
	(= (slew_time Star4 Phenomenon7) 7.062)
	(= (slew_time Phenomenon7 Phenomenon5) 37.45)
	(= (slew_time Phenomenon5 Phenomenon7) 37.45)
	(= (slew_time Phenomenon7 Planet6) 32.12)
	(= (slew_time Planet6 Phenomenon7) 32.12)
	(= (slew_time Phenomenon8 GroundStation0) 49.69)
	(= (slew_time GroundStation0 Phenomenon8) 49.69)
	(= (slew_time Phenomenon8 GroundStation1) 39.13)
	(= (slew_time GroundStation1 Phenomenon8) 39.13)
	(= (slew_time Phenomenon8 GroundStation2) 65.72)
	(= (slew_time GroundStation2 Phenomenon8) 65.72)
	(= (slew_time Phenomenon8 Star3) 4.004)
	(= (slew_time Star3 Phenomenon8) 4.004)
	(= (slew_time Phenomenon8 Star4) 55.21)
	(= (slew_time Star4 Phenomenon8) 55.21)
	(= (slew_time Phenomenon8 Phenomenon5) 35.4)
	(= (slew_time Phenomenon5 Phenomenon8) 35.4)
	(= (slew_time Phenomenon8 Planet6) 23.93)
	(= (slew_time Planet6 Phenomenon8) 23.93)
	(= (slew_time Phenomenon8 Phenomenon7) 31.17)
	(= (slew_time Phenomenon7 Phenomenon8) 31.17)
	(= (slew_time Phenomenon9 GroundStation0) 20.5)
	(= (slew_time GroundStation0 Phenomenon9) 20.5)
	(= (slew_time Phenomenon9 GroundStation1) 30.61)
	(= (slew_time GroundStation1 Phenomenon9) 30.61)
	(= (slew_time Phenomenon9 GroundStation2) 34.47)
	(= (slew_time GroundStation2 Phenomenon9) 34.47)
	(= (slew_time Phenomenon9 Star3) 16.93)
	(= (slew_time Star3 Phenomenon9) 16.93)
	(= (slew_time Phenomenon9 Star4) 6.294)
	(= (slew_time Star4 Phenomenon9) 6.294)
	(= (slew_time Phenomenon9 Phenomenon5) 41.94)
	(= (slew_time Phenomenon5 Phenomenon9) 41.94)
	(= (slew_time Phenomenon9 Planet6) 3.972)
	(= (slew_time Planet6 Phenomenon9) 3.972)
	(= (slew_time Phenomenon9 Phenomenon7) 35.71)
	(= (slew_time Phenomenon7 Phenomenon9) 35.71)
	(= (slew_time Phenomenon9 Phenomenon8) 13.43)
	(= (slew_time Phenomenon8 Phenomenon9) 13.43)
	(= (slew_time Star10 GroundStation0) 59.33)
	(= (slew_time GroundStation0 Star10) 59.33)
	(= (slew_time Star10 GroundStation1) 1.173)
	(= (slew_time GroundStation1 Star10) 1.173)
	(= (slew_time Star10 GroundStation2) 8.61)
	(= (slew_time GroundStation2 Star10) 8.61)
	(= (slew_time Star10 Star3) 31.57)
	(= (slew_time Star3 Star10) 31.57)
	(= (slew_time Star10 Star4) 72.99)
	(= (slew_time Star4 Star10) 72.99)
	(= (slew_time Star10 Phenomenon5) 18.6)
	(= (slew_time Phenomenon5 Star10) 18.6)
	(= (slew_time Star10 Planet6) 54.69)
	(= (slew_time Planet6 Star10) 54.69)
	(= (slew_time Star10 Phenomenon7) 64.73)
	(= (slew_time Phenomenon7 Star10) 64.73)
	(= (slew_time Star10 Phenomenon8) 26.15)
	(= (slew_time Phenomenon8 Star10) 26.15)
	(= (slew_time Star10 Phenomenon9) 18.98)
	(= (slew_time Phenomenon9 Star10) 18.98)
	(= (slew_time Planet11 GroundStation0) 28.9)
	(= (slew_time GroundStation0 Planet11) 28.9)
	(= (slew_time Planet11 GroundStation1) 89.42)
	(= (slew_time GroundStation1 Planet11) 89.42)
	(= (slew_time Planet11 GroundStation2) 27.02)
	(= (slew_time GroundStation2 Planet11) 27.02)
	(= (slew_time Planet11 Star3) 53.9)
	(= (slew_time Star3 Planet11) 53.9)
	(= (slew_time Planet11 Star4) 3.495)
	(= (slew_time Star4 Planet11) 3.495)
	(= (slew_time Planet11 Phenomenon5) 15.61)
	(= (slew_time Phenomenon5 Planet11) 15.61)
	(= (slew_time Planet11 Planet6) 69.5)
	(= (slew_time Planet6 Planet11) 69.5)
	(= (slew_time Planet11 Phenomenon7) 68.18)
	(= (slew_time Phenomenon7 Planet11) 68.18)
	(= (slew_time Planet11 Phenomenon8) 8.059)
	(= (slew_time Phenomenon8 Planet11) 8.059)
	(= (slew_time Planet11 Phenomenon9) 5.256)
	(= (slew_time Phenomenon9 Planet11) 5.256)
	(= (slew_time Planet11 Star10) 57.81)
	(= (slew_time Star10 Planet11) 57.81)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Phenomenon5 spectrograph0)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 spectrograph2)
	(have_image Planet11 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 180 to 166.03, (fuel-used) from 0 to 13.97
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 166.03 to 155.5, (fuel-used) from 13.97 to 24.5
   goals met: 0 of 7
4. (turn_to satellite2 planet11 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 133 to 117.39, (fuel-used) from 24.5 to 40.11
   goals met: 0 of 7
5. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 155.5 to 116.37, (fuel-used) from 40.11 to 79.24
   goals met: 0 of 7
6. (turn_to satellite0 star4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 116.37 to 61.16, (fuel-used) from 79.24 to 134.45
   goals met: 0 of 7
7. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 61.16 to 60.033, (fuel-used) from 134.45 to 135.577
   goals met: 0 of 7
8. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 60.033 to 54.129, (fuel-used) from 135.577 to 141.481
   goals met: 0 of 7
9. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 54.129 to 52.728, (fuel-used) from 141.481 to 142.882
   goals met: 0 of 7
10. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 7
11. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 52.728 to 51.327, (fuel-used) from 142.882 to 144.283
   goals met: 0 of 7
12. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 51.327 to 47.323, (fuel-used) from 144.283 to 148.287
   goals met: 0 of 7
13. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   changed: (data_capacity satellite0) from 1000 to 771, (data-stored) from 0 to 229
   goals met: 1 of 7
14. (turn_to satellite0 star10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 47.323 to 21.173, (fuel-used) from 148.287 to 174.437
   goals met: 2 of 7
15. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   changed: (data_capacity satellite0) from 771 to 569, (data-stored) from 229 to 431
   goals met: 3 of 7
16. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 7
17. (turn_to satellite2 star4 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 117.39 to 113.895, (fuel-used) from 174.437 to 177.932
   goals met: 3 of 7
18. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 3 of 7
19. (turn_to satellite2 planet11 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 113.895 to 110.4, (fuel-used) from 177.932 to 181.427
   goals met: 3 of 7
20. (take_image satellite2 planet11 instrument5 infrared1)
   added: (have_image planet11 infrared1)
   changed: (data_capacity satellite2) from 1000 to 858, (data-stored) from 431 to 573
   goals met: 4 of 7
21. (turn_to satellite2 phenomenon9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon9)
   changed: (fuel satellite2) from 110.4 to 105.144, (fuel-used) from 181.427 to 186.683
   goals met: 4 of 7
22. (turn_to satellite0 groundstation1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 21.173 to 20, (fuel-used) from 186.683 to 187.856
   goals met: 3 of 7
23. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 20 to 11.582, (fuel-used) from 187.856 to 196.274
   goals met: 3 of 7
24. (take_image satellite0 phenomenon5 instrument0 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   changed: (data_capacity satellite0) from 569 to 415, (data-stored) from 573 to 727
   goals met: 4 of 7
25. (turn_to satellite0 star4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 11.582 to 10.455, (fuel-used) from 196.274 to 197.401
   goals met: 4 of 7
26. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 10.455 to 9.054, (fuel-used) from 197.401 to 198.802
   goals met: 4 of 7
27. (turn_to satellite0 groundstation1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 9.054 to 7.107, (fuel-used) from 198.802 to 200.749
   goals met: 4 of 7
28. (turn_to satellite0 star10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 7.107 to 5.934, (fuel-used) from 200.749 to 201.922
   goals met: 5 of 7
29. (turn_to satellite2 phenomenon7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 105.144 to 69.434, (fuel-used) from 201.922 to 237.632
   goals met: 5 of 7
30. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 7
31. (turn_to satellite1 groundstation1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 199 to 168.39, (fuel-used) from 237.632 to 268.242
   goals met: 5 of 7
32. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 5 of 7
33. (turn_to satellite1 phenomenon9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 168.39 to 137.78, (fuel-used) from 268.242 to 298.852
   goals met: 5 of 7
34. (take_image satellite1 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 799, (data-stored) from 727 to 928
   goals met: 6 of 7
35. (take_image satellite2 phenomenon7 instrument5 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   changed: (data_capacity satellite2) from 858 to 580, (data-stored) from 928 to 1206
   goals met: 7 of 7
